; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph1 - mode
	thermograph4 - mode
	image2 - mode
	infrared0 - mode
	infrared3 - mode
	Star2 - direction
	Star3 - direction
	Star5 - direction
	GroundStation0 - direction
	Star1 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation4 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 image2)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument3 image2)
	(supports instrument3 infrared0)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation6)
)
(:goal (and
	(have_image Planet8 infrared3)
	(have_image Planet9 image2)
	(have_image Star10 infrared0)
	(have_image Planet11 infrared0)
	(have_image Star12 infrared0)
	(have_image Planet13 infrared0)
	(have_image Phenomenon14 image2)
))

)

; plan
1. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 7
2. (calibrate satellite2 instrument3 groundstation6)
   added: (calibrated instrument3)
   goals met: 0 of 7
3. (turn_to satellite2 planet8 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 planet8)
   goals met: 0 of 7
4. (take_image satellite2 planet8 instrument3 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 1 of 7
5. (turn_to satellite2 planet13 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet13)
   goals met: 1 of 7
6. (take_image satellite2 planet13 instrument3 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 2 of 7
7. (turn_to satellite2 planet11 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet11)
   goals met: 2 of 7
8. (take_image satellite2 planet11 instrument3 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 3 of 7
9. (turn_to satellite2 phenomenon14 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon14)
   goals met: 3 of 7
10. (take_image satellite2 phenomenon14 instrument3 image2)
   added: (have_image phenomenon14 image2)
   goals met: 4 of 7
11. (turn_to satellite2 planet9 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 planet9)
   goals met: 4 of 7
12. (take_image satellite2 planet9 instrument3 image2)
   added: (have_image planet9 image2)
   goals met: 5 of 7
13. (turn_to satellite2 star10 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star10)
   goals met: 5 of 7
14. (take_image satellite2 star10 instrument3 infrared0)
   added: (have_image star10 infrared0)
   goals met: 6 of 7
15. (turn_to satellite2 star12 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star12)
   goals met: 6 of 7
16. (take_image satellite2 star12 instrument3 infrared0)
   added: (have_image star12 infrared0)
   goals met: 7 of 7
